
# 给定两个整数 n 和 k，返回 [1, n] 范围之内的 k 个数字的所有可能组合。其中 1 <= n <= 30, 1 <= k <= n
# 比如给定 n=3 , k =2 返回 [1, 3] 范围之内 所有可能的2个数字组合，也就是返回[1,2],[1,3],[2,3]
<html>
    <head>
    </head>
    <body>
        <div>
            <b>给定两个整数 n 和 k，返回 [1, n] 范围之内的 k 个数字的所有可能组合。其中 1 <= n <= 30, 1 <= k <= n
            <br>
            <p>比如给定 n=3 , k =2 返回 [1, 3] 范围之内 所有可能的2个数字组合，也就是返回[1,2],[1,3],[2,3]</p>
        </div>
        <div>
            <p>你寻思就这都能给👴整不会了?</p>
            <pre><?php echo $pr; ?></pre>
        </div>
    </body>



<?php
$n = 0;
$k = 0;



echo "RangeNumber:".$n.",".$k;







?>

